Masmiseim36/nxpSDK/boards/frdmimxrt1186/ota_examples/ota_mcuboot_server/enet/cm33/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_PWMPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIO_PWMPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12,  /* GPIO_EMC_B1_12 is configured as FLEXIO1_FLEXIO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12,  /* GPIO_EMC_B1_12 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXSPI_FLRPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: J11, peripheral: FLEXSPI_SLV, signal: CLK, pin_signal: GPIO_SD_B2_07}
  - {pin_num: E11, peripheral: FLEXSPI_SLV, signal: CS, pin_signal: GPIO_SD_B2_06}
  - {pin_num: D13, peripheral: FLEXSPI_SLV, signal: DQS, pin_signal: GPIO_SD_B2_05}
  - {pin_num: G11, peripheral: FLEXSPI_SLV, signal: 'DATA, 0', pin_signal: GPIO_SD_B2_08}
  - {pin_num: E12, peripheral: FLEXSPI_SLV, signal: 'DATA, 1', pin_signal: GPIO_SD_B2_09}
  - {pin_num: F12, peripheral: FLEXSPI_SLV, signal: 'DATA, 2', pin_signal: GPIO_SD_B2_10}
  - {pin_num: E13, peripheral: FLEXSPI_SLV, signal: 'DATA, 3', pin_signal: GPIO_SD_B2_11}
  - {pin_num: G13, peripheral: FLEXSPI_SLV, signal: 'DATA, 4', pin_signal: GPIO_SD_B2_00}
  - {pin_num: F14, peripheral: FLEXSPI_SLV, signal: 'DATA, 5', pin_signal: GPIO_SD_B2_01}
  - {pin_num: F13, peripheral: FLEXSPI_SLV, signal: 'DATA, 6', pin_signal: GPIO_SD_B2_02}
  - {pin_num: H11, peripheral: FLEXSPI_SLV, signal: 'DATA, 7', pin_signal: GPIO_SD_B2_03}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXSPI_FLRPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXSPI_FLRPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_00_XSPI_SLV_DATA04,   /* GPIO_SD_B2_00 is configured as XSPI_SLV_DATA04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_01_XSPI_SLV_DATA05,   /* GPIO_SD_B2_01 is configured as XSPI_SLV_DATA05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_02_XSPI_SLV_DATA06,   /* GPIO_SD_B2_02 is configured as XSPI_SLV_DATA06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_03_XSPI_SLV_DATA07,   /* GPIO_SD_B2_03 is configured as XSPI_SLV_DATA07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_05_XSPI_SLV_DQS,      /* GPIO_SD_B2_05 is configured as XSPI_SLV_DQS */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_06_XSPI_SLV_CS,       /* GPIO_SD_B2_06 is configured as XSPI_SLV_CS */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_07_XSPI_SLV_CLK,      /* GPIO_SD_B2_07 is configured as XSPI_SLV_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_08_XSPI_SLV_DATA00,   /* GPIO_SD_B2_08 is configured as XSPI_SLV_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_09_XSPI_SLV_DATA01,   /* GPIO_SD_B2_09 is configured as XSPI_SLV_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_10_XSPI_SLV_DATA02,   /* GPIO_SD_B2_10 is configured as XSPI_SLV_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_11_XSPI_SLV_DATA03,   /* GPIO_SD_B2_11 is configured as XSPI_SLV_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSB_PDPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: C2, peripheral: RGPIO2, signal: 'gpio_io, 17', pin_signal: GPIO_EMC_B1_17, software_input_on: Disable, pull_down_pull_up_config: No_Pull, open_drain: Disable}
  - {pin_num: G1, peripheral: RGPIO2, signal: 'gpio_io, 16', pin_signal: GPIO_EMC_B1_16, software_input_on: Disable, pull_down_pull_up_config: No_Pull, open_drain: Disable}
  - {pin_num: N14, peripheral: RGPIO4, signal: 'gpio_io, 12', pin_signal: GPIO_AD_12, software_input_on: Disable, pull_keeper_select: Pull, open_drain: Disable}
  - {pin_num: E5, peripheral: RGPIO2, signal: 'gpio_io, 14', pin_signal: GPIO_EMC_B1_14, software_input_on: Disable, pull_down_pull_up_config: Pull_Up, open_drain: Disable}
  - {pin_num: D7, peripheral: RGPIO2, signal: 'gpio_io, 12', pin_signal: GPIO_EMC_B1_12, software_input_on: Disable, pull_down_pull_up_config: No_Pull, open_drain: Disable}
  - {pin_num: E2, peripheral: RGPIO2, signal: 'gpio_io, 15', pin_signal: GPIO_EMC_B1_15, software_input_on: Disable, pull_down_pull_up_config: No_Pull, open_drain: Disable}
  - {pin_num: E3, peripheral: RGPIO2, signal: 'gpio_io, 13', pin_signal: GPIO_EMC_B1_13, identifier: '', software_input_on: Disable, pull_down_pull_up_config: No_Pull,
    open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

