Masmiseim36/nxpSDK/boards/frdmimxrt1186/ota_examples/ota_mcuboot_server/enet/cm33/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSB_PDI2CPins_deinit, assigned for the Cortex-M33 core.
 * Description   : This is a de-initialization function for 'BOARD_InitUSB_PDI2CPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSB_PDI2CPins_deinit(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration on GPIO_EMC_B2_19 (pin M9) */
  rgpio_pin_config_t gpio3_pinM9_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_19 (pin M9) */
  RGPIO_PinInit(RGPIO3, 29U, &gpio3_pinM9_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B2_19 (pin M9) */
  RGPIO_SetPinInterruptConfig(RGPIO3, 29U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration on GPIO_EMC_B2_20 (pin M8) */
  rgpio_pin_config_t gpio3_pinM8_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_20 (pin M8) */
  RGPIO_PinInit(RGPIO3, 30U, &gpio3_pinM8_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B2_20 (pin M8) */
  RGPIO_SetPinInterruptConfig(RGPIO3, 30U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_19_GPIO3_IO29,       /* GPIO_EMC_B2_19 is configured as GPIO3_IO29 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_20_GPIO3_IO30,       /* GPIO_EMC_B2_20 is configured as GPIO3_IO30 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_19_GPIO3_IO29,       /* GPIO_EMC_B2_19 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_20_GPIO3_IO30,       /* GPIO_EMC_B2_20 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSRAMCPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: G3, peripheral: SRAMC, signal: 'DATA, 0', pin_signal: GPIO_EMC_B1_00, pdrv_config: High_Driver}
  - {pin_num: H4, peripheral: SRAMC, signal: 'DATA, 1', pin_signal: GPIO_EMC_B1_01, pdrv_config: High_Driver}
  - {pin_num: K2, peripheral: SRAMC, signal: 'DATA, 2', pin_signal: GPIO_EMC_B1_02, pdrv_config: High_Driver}
  - {pin_num: F3, peripheral: SRAMC, signal: 'DATA, 3', pin_signal: GPIO_EMC_B1_03, pdrv_config: High_Driver}
  - {pin_num: J4, peripheral: SRAMC, signal: 'DATA, 4', pin_signal: GPIO_EMC_B1_04, pdrv_config: High_Driver}
  - {pin_num: E7, peripheral: SRAMC, signal: 'DATA, 5', pin_signal: GPIO_EMC_B1_05, pdrv_config: High_Driver}
  - {pin_num: K3, peripheral: SRAMC, signal: 'DATA, 6', pin_signal: GPIO_EMC_B1_06, pdrv_config: High_Driver}
  - {pin_num: J3, peripheral: SRAMC, signal: 'DATA, 7', pin_signal: GPIO_EMC_B1_07, pdrv_config: High_Driver}
  - {pin_num: F2, peripheral: SRAMC, signal: 'DATA, 8', pin_signal: GPIO_EMC_B1_30, pdrv_config: High_Driver}
  - {pin_num: G2, peripheral: SRAMC, signal: 'DATA, 9', pin_signal: GPIO_EMC_B1_31, pdrv_config: High_Driver}
  - {pin_num: J1, peripheral: SRAMC, signal: 'DATA, 10', pin_signal: GPIO_EMC_B1_32, pdrv_config: High_Driver}
  - {pin_num: K1, peripheral: SRAMC, signal: 'DATA, 11', pin_signal: GPIO_EMC_B1_33, pdrv_config: High_Driver}
  - {pin_num: L2, peripheral: SRAMC, signal: 'DATA, 12', pin_signal: GPIO_EMC_B1_34, pdrv_config: High_Driver}
  - {pin_num: L1, peripheral: SRAMC, signal: 'DATA, 13', pin_signal: GPIO_EMC_B1_35, pdrv_config: High_Driver}
  - {pin_num: F5, peripheral: SRAMC, signal: 'DATA, 14', pin_signal: GPIO_EMC_B1_36, pdrv_config: High_Driver}
  - {pin_num: H2, peripheral: SRAMC, signal: 'DATA, 15', pin_signal: GPIO_EMC_B1_37, pdrv_config: High_Driver}
  - {pin_num: H1, peripheral: SRAMC, signal: sramc_we, pin_signal: GPIO_EMC_B1_26, pdrv_config: High_Driver}
  - {pin_num: H3, peripheral: SRAMC, signal: sramc_oeb, pin_signal: GPIO_EMC_B1_27, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
  - {pin_num: D5, peripheral: SRAMC, signal: sramc_adv, pin_signal: GPIO_EMC_B1_28, pdrv_config: High_Driver}
  - {pin_num: E4, peripheral: SRAMC, signal: 'CS, 0', pin_signal: GPIO_EMC_B1_29, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSRAMCPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSRAMCPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_AHB_SRAMC_DATA00,  /* GPIO_EMC_B1_00 is configured as AHB_SRAMC_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_AHB_SRAMC_DATA01,  /* GPIO_EMC_B1_01 is configured as AHB_SRAMC_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_AHB_SRAMC_DATA02,  /* GPIO_EMC_B1_02 is configured as AHB_SRAMC_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_03_AHB_SRAMC_DATA03,  /* GPIO_EMC_B1_03 is configured as AHB_SRAMC_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_AHB_SRAMC_DATA04,  /* GPIO_EMC_B1_04 is configured as AHB_SRAMC_DATA04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_05_AHB_SRAMC_DATA05,  /* GPIO_EMC_B1_05 is configured as AHB_SRAMC_DATA05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_06_AHB_SRAMC_DATA06,  /* GPIO_EMC_B1_06 is configured as AHB_SRAMC_DATA06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_07_AHB_SRAMC_DATA07,  /* GPIO_EMC_B1_07 is configured as AHB_SRAMC_DATA07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_26_AHB_SRAMC_WE,     /* GPIO_EMC_B1_26 is configured as AHB_SRAMC_WE */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_27_AHB_SRAMC_OEB,    /* GPIO_EMC_B1_27 is configured as AHB_SRAMC_OEB */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_28_AHB_SRAMC_ADV,    /* GPIO_EMC_B1_28 is configured as AHB_SRAMC_ADV */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_29_AHB_SRAMC_CS0,    /* GPIO_EMC_B1_29 is configured as AHB_SRAMC_CS0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_30_AHB_SRAMC_DATA08,  /* GPIO_EMC_B1_30 is configured as AHB_SRAMC_DATA08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_31_AHB_SRAMC_DATA09,  /* GPIO_EMC_B1_31 is configured as AHB_SRAMC_DATA09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_32_AHB_SRAMC_DATA10,  /* GPIO_EMC_B1_32 is configured as AHB_SRAMC_DATA10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_33_AHB_SRAMC_DATA11,  /* GPIO_EMC_B1_33 is configured as AHB_SRAMC_DATA11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_34_AHB_SRAMC_DATA12,  /* GPIO_EMC_B1_34 is configured as AHB_SRAMC_DATA12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_35_AHB_SRAMC_DATA13,  /* GPIO_EMC_B1_35 is configured as AHB_SRAMC_DATA13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_36_AHB_SRAMC_DATA14,  /* GPIO_EMC_B1_36 is configured as AHB_SRAMC_DATA14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_37_AHB_SRAMC_DATA15,  /* GPIO_EMC_B1_37 is configured as AHB_SRAMC_DATA15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_00_AHB_SRAMC_DATA00,  /* GPIO_EMC_B1_00 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_01_AHB_SRAMC_DATA01,  /* GPIO_EMC_B1_01 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_02_AHB_SRAMC_DATA02,  /* GPIO_EMC_B1_02 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_03_AHB_SRAMC_DATA03,  /* GPIO_EMC_B1_03 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_04_AHB_SRAMC_DATA04,  /* GPIO_EMC_B1_04 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_05_AHB_SRAMC_DATA05,  /* GPIO_EMC_B1_05 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_06_AHB_SRAMC_DATA06,  /* GPIO_EMC_B1_06 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_07_AHB_SRAMC_DATA07,  /* GPIO_EMC_B1_07 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_26_AHB_SRAMC_WE,     /* GPIO_EMC_B1_26 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_27_AHB_SRAMC_OEB,    /* GPIO_EMC_B1_27 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_28_AHB_SRAMC_ADV,    /* GPIO_EMC_B1_28 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_29_AHB_SRAMC_CS0,    /* GPIO_EMC_B1_29 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_30_AHB_SRAMC_DATA08,  /* GPIO_EMC_B1_30 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_31_AHB_SRAMC_DATA09,  /* GPIO_EMC_B1_31 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_32_AHB_SRAMC_DATA10,  /* GPIO_EMC_B1_32 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_33_AHB_SRAMC_DATA11,  /* GPIO_EMC_B1_33 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_34_AHB_SRAMC_DATA12,  /* GPIO_EMC_B1_34 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_35_AHB_SRAMC_DATA13,  /* GPIO_EMC_B1_35 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_36_AHB_SRAMC_DATA14,  /* GPIO_EMC_B1_36 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_37_AHB_SRAMC_DATA15,  /* GPIO_EMC_B1_37 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


